# 相关性验证  Vicuna模型

from scipy.stats import pearsonr, spearmanr, kendalltau

## 贝叶斯优化得到的
ratio1_8 = [0.59700192,0.76813825,0.9481952,0.9481952,0.9481952,0.9481952,0.85583155,0.9481952,0.77649692,0.71283235,0.65190775,0.78885188,0.86020153,0.83651402,0.85595998,0.9481952,0.87400903,0.92464963,0.90996209,0.8610263,0.85455071,0.76273061,0.72712014,0.73447863,0.69648933,0.67512856,0.72309583,0.6768789,0.78920115,0.6409697,0.72383763,0.63296439]
ratio1_7 = [0.50175422,0.80179475,0.85237401,0.95706593,0.86923101,0.90453245,0.76802439,0.83320083,0.66875449,0.69144545,0.50175422,0.71233495, 0.85692712,0.75530431,0.84008004,0.86784305,0.8890871 ,0.65136504,0.75840017,0.74614005,0.67271762,0.58973022,0.67143917,0.58411168,0.50175422,0.50175422,0.61646076,0.60165664,0.50175422,0.50175422,0.72769921,0.50175422]
ratio1_6 = [0.45852712,0.74137466,0.8140282,0.95198754,0.79192939, 0.87164759,0.73668272,0.75307537,0.64138094,0.45163508,0.57632983,0.55420449,0.78123887,0.68206394,0.75298724,0.80408131,0.83363316,0.52508567,0.61511184,0.65716213,0.52077019,0.4518841,0.5080388,0.47752183,0.39450214,0.43973719,0.45109401,0.37521535,0.44683538,0.24721279,0.47388439,0.41913674]
ratio1_5 = [0.37078173, 0.5503113, 0.622523, 0.680297, 0.621275, 0.64866077, 0.562033, 0.603445, 0.496817, 0.441884, 0.41190281, 0.48937889, 0.5948494, 0.54140054, 0.58310173, 0.62383799, 0.618268879, 0.500261986, 0.54368431, 0.53912582889, 0.48762822, 0.4296059, 0.45395193, 0.42764574787, 0.3792251645, 0.3849095, 0.42634538, 0.3937502, 0.4137597, 0.3309373, 0.4584336265, 0.3699655597]


# ## 计算得到的
ratio2_8 = [0.664717, 0.811073, 0.806825, 0.980000, 0.930853, 0.980000, 0.958436, 0.925166, 0.833742, 0.825784, 0.817919, 0.811885, 0.801818, 0.799709, 0.798337, 0.792096, 0.779404, 0.765089, 0.779351, 0.776443, 0.767845, 0.772058, 0.762741, 0.764060, 0.773127, 0.763628, 0.756617, 0.751249, 0.730518, 0.744129, 0.720202, 0.655174]
ratio2_7 = [0.522455, 0.712358, 0.706846, 0.980000, 0.867779, 0.947402, 0.903569, 0.860400, 0.741773, 0.731447, 0.721241, 0.713411, 0.700350, 0.697613, 0.695832, 0.687734, 0.671266, 0.652692, 0.671197, 0.667424, 0.656268, 0.661734, 0.649645, 0.651356, 0.663122, 0.650795, 0.641699, 0.634733, 0.607835, 0.625495, 0.594448, 0.510072]
ratio2_6 = [0.522455, 0.712358, 0.706846, 0.980000, 0.867779, 0.947402, 0.903569, 0.860400, 0.741773, 0.731447, 0.721241, 0.713411, 0.700350, 0.697613, 0.695832, 0.687734, 0.671266, 0.652692, 0.671197, 0.667424, 0.656268, 0.661734, 0.649645, 0.651356, 0.663122, 0.650795, 0.641699, 0.634733, 0.607835, 0.625495, 0.594448, 0.510072]
ratio2_5 = [0.310405, 0.509714, 0.503929, 0.892225, 0.672832, 0.756399, 0.710396, 0.665088, 0.540586, 0.529748, 0.519037, 0.510819, 0.497111, 0.494238, 0.492370, 0.483870, 0.466587, 0.447092, 0.466515, 0.462555, 0.450846, 0.456583, 0.443895, 0.445691, 0.458039, 0.445102, 0.435555, 0.428244, 0.400014, 0.418549, 0.385964, 0.300000]


# ratio2_8 = [0.629273, 0.805029, 0.776935, 0.980000, 0.961604, 0.980000, 0.980000, 0.978684, 0.842416, 0.833207, 0.823824, 0.817158, 0.803553, 0.802372, 0.802021, 0.794760, 0.777163, 0.757620, 0.779875, 0.777343, 0.765416, 0.773000, 0.760314, 0.763140, 0.778621, 0.765069, 0.755450, 0.747529, 0.717796, 0.739980, 0.707504, 0.623337]
# ratio2_7 = [0.520403, 0.697680, 0.669343, 0.980000, 0.855610, 0.960897, 0.918151, 0.872838, 0.735390, 0.726102, 0.716638, 0.709914, 0.696191, 0.695001, 0.694646, 0.687322, 0.669573, 0.649861, 0.672309, 0.669754, 0.657724, 0.665374, 0.652578, 0.655428, 0.671043, 0.657375, 0.647673, 0.639683, 0.609693, 0.632069, 0.599311, 0.514416]
# ratio2_6 = [0.413898, 0.594584, 0.565702, 0.980000, 0.755551, 0.862862, 0.819294, 0.773110, 0.633019, 0.623552, 0.613906, 0.607052, 0.593066, 0.591853, 0.591491, 0.584026, 0.565936, 0.545845, 0.568724, 0.566121, 0.553859, 0.561656, 0.548615, 0.551519, 0.567435, 0.553503, 0.543615, 0.535471, 0.504904, 0.527711, 0.494323, 0.407795]
# ratio2_5 = [0.307336, 0.494068, 0.464220, 0.903087, 0.660421, 0.771324, 0.726298, 0.678568, 0.533789, 0.524006, 0.514037, 0.506954, 0.492500, 0.491245, 0.490872, 0.483157, 0.464462, 0.443698, 0.467343, 0.464653, 0.451981, 0.460039, 0.446561, 0.449563, 0.466010, 0.451613, 0.441393, 0.432977, 0.401388, 0.424957, 0.390453, 0.301029]




# print(np.min(ratio1_5),np.max(ratio1_5),np.mean(ratio1_5),np.std(ratio1_5))
# print(np.min(ratio1_6),np.max(ratio1_6),np.mean(ratio1_6),np.std(ratio1_6))
# print(np.min(ratio2_6),np.max(ratio2_6),np.mean(ratio2_6),np.std(ratio2_6))

# pearson_corr, p_value = pearsonr(ratio1_8, ratio1_6)
# print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

print('-' * 100)

pearson_corr, p_value = pearsonr(ratio1_8, ratio2_8)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_7, ratio2_8)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_6, ratio2_8)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_5, ratio2_8)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

print('-' * 100)

pearson_corr, p_value = pearsonr(ratio1_8, ratio2_7)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_7, ratio2_7)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_6, ratio2_7)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_5, ratio2_7)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

print('-' * 100)

pearson_corr, p_value = pearsonr(ratio1_8, ratio2_6)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_7, ratio2_6)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_6, ratio2_6)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_5, ratio2_6)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

print('-' * 100)

pearson_corr, p_value = pearsonr(ratio1_8, ratio2_5)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_7, ratio2_5)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_6, ratio2_5)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")

pearson_corr, p_value = pearsonr(ratio1_5, ratio2_5)
print(f"Pearson correlation coefficient: {pearson_corr}, p-value: {p_value}")